Lesson-4-Methods/Practice-Problems-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-21 Fri 18:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 4: Practice Problems: Methods</title>
<meta name="author" content="Brady Stanton" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 4: Practice Problems: Methods</h1>

<div id="outline-container-orgfd5b3ec" class="outline-2">
<h2 id="orgfd5b3ec">Practice Problem 1</h2>
<div class="outline-text-2" id="text-orgfd5b3ec">
</div>
<div id="outline-container-org5055bbf" class="outline-3">
<h3 id="org5055bbf">Question</h3>
<div class="outline-text-3" id="text-org5055bbf">
<p>
What is the return value of the <code>select</code> method below? Why?
</p>
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>].select <span style="color: #859900; font-weight: bold;">do</span> |num|
  num &gt; <span style="color: #d33682; font-weight: bold;">5</span>
  <span style="color: #2aa198;">'hi'</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org57966ef">
[1, 2, 3]
</pre>
</div>
</div>

<div id="outline-container-orgb1e8906" class="outline-3">
<h3 id="orgb1e8906">Answer</h3>
<div class="outline-text-3" id="text-orgb1e8906">
<p>
The return value of the indicated <code>select</code> method will be the same array that we started out with, <code>[1, 2, 3]</code>. The reason for this is <code>Array#select</code> or <code>Enumerable#select</code> takes a block as an argument and returns all the values in a collection for which the block returns a truthy value. Without the second expression <code>hi</code>, none of the elements in the array would evaluate to <code>true</code> because none of them are greater than <code>5</code>. However, the expression <code>'hi'</code> is neither <code>false</code> nor <code>nil</code>, so it in of itself is truthy. It is truthy regardless of the value of any of <code>num</code>. Therefore the return value will be the array <code>[1, 2, 3]</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org3d9c513" class="outline-2">
<h2 id="org3d9c513">Practice Problem 2</h2>
<div class="outline-text-2" id="text-org3d9c513">
</div>
<div id="outline-container-org343f5c2" class="outline-3">
<h3 id="org343f5c2">Question</h3>
<div class="outline-text-3" id="text-org343f5c2">
<p>
How does <code>count</code> treat the block&rsquo;s return value? How can we find out?
</p>
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #2aa198;">'ant'</span>, <span style="color: #2aa198;">'bat'</span>, <span style="color: #2aa198;">'caterpillar'</span>].count <span style="color: #859900; font-weight: bold;">do</span> |str|
  str.length &lt; <span style="color: #d33682; font-weight: bold;">4</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org7d318d0">
2
</pre>
</div>
</div>

<div id="outline-container-org7d088d5" class="outline-3">
<h3 id="org7d088d5">Answer</h3>
<div class="outline-text-3" id="text-org7d088d5">
<p>
<code>Array#count</code> in this case treats the block&rsquo;s return value as truthy or falsey. It will return a count of all elements for which the block returns a truthy value. We can find out for sure by running the code and inspecting its output.
</p>
</div>
</div>
</div>

<div id="outline-container-org110aebb" class="outline-2">
<h2 id="org110aebb">Practice Problem 3</h2>
<div class="outline-text-2" id="text-org110aebb">
</div>
<div id="outline-container-org10932d5" class="outline-3">
<h3 id="org10932d5">Question</h3>
<div class="outline-text-3" id="text-org10932d5">
<p>
What is the return value of <code>reject</code> in the following code? Why?
</p>
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>].reject <span style="color: #859900; font-weight: bold;">do</span> |num|
  <span style="color: #268bd2;">puts</span> num
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org4a041c4">
[1, 2, 3]
</pre>
</div>
</div>

<div id="outline-container-org27b5f8b" class="outline-3">
<h3 id="org27b5f8b">Answer</h3>
<div class="outline-text-3" id="text-org27b5f8b">
<p>
The return value of <code>reject</code> here will be the original array, <code>[1, 2, 3]</code>. The reason for this is that <code>Array#reject</code> will return a new array that excludes any element for which the code block returns a truthy value. The expression <code>puts num</code> evaluates to <code>nil</code> regardless of the value of the block variable <code>num</code>. All 3 elements therefore have <code>nil</code> returned, so none get &ldquo;rejected&rdquo;.
</p>
</div>
</div>
</div>

<div id="outline-container-org19db9a5" class="outline-2">
<h2 id="org19db9a5">Practice Problem 4</h2>
<div class="outline-text-2" id="text-org19db9a5">
</div>
<div id="outline-container-orgeddc787" class="outline-3">
<h3 id="orgeddc787">Question</h3>
<div class="outline-text-3" id="text-orgeddc787">
<p>
What is the return value of <code>each_with_object</code> in the following code? Why?
</p>
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #2aa198;">'ant'</span>, <span style="color: #2aa198;">'bear'</span>, <span style="color: #2aa198;">'cat'</span>].each_with_object({}) <span style="color: #859900; font-weight: bold;">do</span> |value, hash|
  hash[value[<span style="color: #d33682; font-weight: bold;">0</span>]] = value
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org16bfa30">
{"a"=&gt;"ant", "b"=&gt;"bear", "c"=&gt;"cat"}
</pre>
</div>
</div>

<div id="outline-container-org81b0ce8" class="outline-3">
<h3 id="org81b0ce8">Answer</h3>
<div class="outline-text-3" id="text-org81b0ce8">
<p>
<code>{"a" =&gt; "ant", "b" =&gt; "bear", "c" =&gt; "cat"}</code>. What is happening is that the method <code>Enumerable#each_with_object</code> takes both an argument in parenthesis and a code block. The argument is an object that the code block builds/modifies with each iteration through the collection. The code block takes 2 variables: the first is the value of the current element in the collection and the second is the variable pointing to the object specified as an argument in the parenthesis. This object will also be the return value.
Now for each element, we must understand what <code>value</code> refers to in order to understand what <code>value[0]</code> is. <code>value</code> points to each string in the array. <code>value[0]</code> is the first letter in that string. <code>hash</code> is the return object passed into <code>each_with_object</code> as an empty hash. So for each element in the original array, <code>hash</code> will have a key of the first letter in each string whose value is the whole string it originated from.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd19b799" class="outline-2">
<h2 id="orgd19b799">Practice Problem 5</h2>
<div class="outline-text-2" id="text-orgd19b799">
</div>
<div id="outline-container-orgf81b5c7" class="outline-3">
<h3 id="orgf81b5c7">Question</h3>
<div class="outline-text-3" id="text-orgf81b5c7">
<p>
What does shift do in the following code? How can we find out?
</p>
<div class="org-src-container">
<pre class="src src-ruby">hash = { <span style="color: #d33682; font-weight: bold;">a:</span> <span style="color: #2aa198;">'ant'</span>, <span style="color: #d33682; font-weight: bold;">b:</span> <span style="color: #2aa198;">'bear'</span> }
hash.shift
</pre>
</div>

<pre class="example" id="org37c50ca">
[:a, "ant"]
</pre>
</div>
</div>

<div id="outline-container-orgfac93d4" class="outline-3">
<h3 id="orgfac93d4">Answer</h3>
<div class="outline-text-3" id="text-orgfac93d4">
<p>
<code>Hash#shift</code> will mutate the object that calls it by removing the first key-value pair and returning them as a 2-element array. So in this case <code>hash.shift</code> will return the object <code>[:a, "ant"]</code> and <code>hash</code> will have the value <code>{ b: 'bear' }</code>. We can find out 2 ways: running the code to see what happens, or consult the documentation.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #268bd2;">puts</span> hash
</pre>
</div>

<pre class="example" id="org4da074f">
{:b=&gt;"bear"}
</pre>
</div>
</div>
</div>

<div id="outline-container-org96c97e4" class="outline-2">
<h2 id="org96c97e4">Practice Problem 6</h2>
<div class="outline-text-2" id="text-org96c97e4">
</div>
<div id="outline-container-org8876ea5" class="outline-3">
<h3 id="org8876ea5">Question</h3>
<div class="outline-text-3" id="text-org8876ea5">
<p>
What is the return value of the following statement? Why?
</p>
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #2aa198;">'ant'</span>, <span style="color: #2aa198;">'bear'</span>, <span style="color: #2aa198;">'caterpillar'</span>].pop.size
</pre>
</div>

<pre class="example" id="orgbf54339">
11
</pre>
</div>
</div>

<div id="outline-container-org402a970" class="outline-3">
<h3 id="org402a970">Answer</h3>
<div class="outline-text-3" id="text-org402a970">
<p>
<code>11</code>
While <code>Array#pop</code> does remove the last element, keep in mind that its return value is that element. So when the <code>.size</code> method is called, it is calling <code>String#size</code> on <code>'caterpillar'</code> , not <code>Array#size</code> on <code>['ant', 'bear']</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf0c0773" class="outline-2">
<h2 id="orgf0c0773">Practice Problem 7</h2>
<div class="outline-text-2" id="text-orgf0c0773">
</div>
<div id="outline-container-orga70ea5c" class="outline-3">
<h3 id="orga70ea5c">Question</h3>
<div class="outline-text-3" id="text-orga70ea5c">
<p>
What is the <b>block</b>&rsquo;s return value in the following code? How is it determined? Also, what is the return value of <code>any?</code> in this code and what does it output?
</p>
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>].any? <span style="color: #859900; font-weight: bold;">do</span> |num|
  <span style="color: #268bd2;">puts</span> num
  num.odd?
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org8b62b19">
true
</pre>
</div>
</div>

<div id="outline-container-org25f967a" class="outline-3">
<h3 id="org25f967a">Answer</h3>
<div class="outline-text-3" id="text-org25f967a">
<p>
The block&rsquo;s return value will be <code>true</code> for elements <code>1</code> and <code>3</code>, and <code>false</code> for element <code>2</code>. The return value of <code>any?</code> here will be <code>true</code>. This is because <code>Enumerable#any?</code> will take a code block and evaluate its elements in that code block. If the code block returns a truthy value for at least one element, the return value of the method will be <code>true</code>. When the expression <code>num.odd?</code> is called for elements <code>1</code> and <code>3</code>, it will result in the value <code>true</code> due to being the last expression in the block.
As far as output, the documentation does not specify if <code>Enumerable#any?</code> or <code>Array#any?</code> will evaluate every single element even if it already came across an element for which its block results in <code>true</code>. Running the short code snippet in the REPL will give the answer.
</p>

<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">3</span>, <span style="color: #d33682; font-weight: bold;">5</span>, <span style="color: #d33682; font-weight: bold;">7</span>].any? <span style="color: #859900; font-weight: bold;">do</span> |num|
  <span style="color: #268bd2;">puts</span> num
  num.odd?
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="orgb1f735b">
1
</pre>

<p>
It appears that the iteration loop breaks once one of the elements causes the block to return <code>true</code>. The method passes <code>1</code> to the block, prints it to the console, and evaluates <code>1.odd?</code> to be <code>true</code>. There is no value of any following element that will cause <code>any?</code> to return <code>false</code> at this point since it found a truthy value. It breaks execution of the loop and <code>1</code> is the only value that is printed to the screen.
</p>
</div>
</div>
</div>

<div id="outline-container-org90aa9fe" class="outline-2">
<h2 id="org90aa9fe">Practice Problem 8</h2>
<div class="outline-text-2" id="text-org90aa9fe">
</div>
<div id="outline-container-orga3b0ba5" class="outline-3">
<h3 id="orga3b0ba5">Question:</h3>
<div class="outline-text-3" id="text-orga3b0ba5">
<p>
How does <code>take</code> work? Is it destructive? How can we find out?
</p>
<div class="org-src-container">
<pre class="src src-ruby">arr = [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>, <span style="color: #d33682; font-weight: bold;">4</span>, <span style="color: #d33682; font-weight: bold;">5</span>]
arr.take(<span style="color: #d33682; font-weight: bold;">2</span>)
</pre>
</div>

<pre class="example" id="org9f8926b">
[1, 2]
</pre>
</div>
</div>

<div id="outline-container-orgaab0c17" class="outline-3">
<h3 id="orgaab0c17">Answer:</h3>
<div class="outline-text-3" id="text-orgaab0c17">
<p>
<code>Array#take</code> (or, broadly, <code>Enumerable#take</code>) <i>takes</i> the first <i>n</i> elements in a collection (where <i>n</i> is the numerical argument passed to the method) and returns them. It is non-destructive. Like before, we can find out by reading the documentation and by running the code.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #268bd2;">p</span> arr
</pre>
</div>

<pre class="example" id="orgc630cd7">
[1, 2, 3, 4, 5]
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9eb0c6" class="outline-2">
<h2 id="orga9eb0c6">Practice Problem 9</h2>
<div class="outline-text-2" id="text-orga9eb0c6">
</div>
<div id="outline-container-org6ae92c5" class="outline-3">
<h3 id="org6ae92c5">Question:</h3>
<div class="outline-text-3" id="text-org6ae92c5">
<p>
What is the return value of <code>map</code> in the following code? Why?
</p>
<div class="org-src-container">
<pre class="src src-ruby">{ <span style="color: #d33682; font-weight: bold;">a:</span> <span style="color: #2aa198;">'ant'</span>, <span style="color: #d33682; font-weight: bold;">b:</span> <span style="color: #2aa198;">'bear'</span> }.map <span style="color: #859900; font-weight: bold;">do</span> |key, value|
  <span style="color: #859900; font-weight: bold;">if</span> value.size &gt; <span style="color: #d33682; font-weight: bold;">3</span>
    value
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org19df558">
[nil, "bear"]
</pre>
</div>
</div>

<div id="outline-container-orgc10e6a6" class="outline-3">
<h3 id="orgc10e6a6">Answer:</h3>
<div class="outline-text-3" id="text-orgc10e6a6">
<p>
I expect that the return value will be a hash with two elements, <code>{ a: nil, b: 'bear' }</code>. This is because the string <code>'ant'</code> has a size of 3 but the conditional evaluates to <code>true</code> only if the size is greather than 3. There are no further tests to result in a return value for the <code>if</code> expression. The return value of <code>if</code> is the last expression evaluated, excluding the test expression. If no expression is evaluated, then the return value will be <code>nil</code>. This is demonstrated in the following code snippets:
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #d33682; font-weight: bold;">true</span>
  <span style="color: #405A61;"># </span><span style="color: #405A61;">no expression</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org8a269f0">
nil
</pre>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #d33682; font-weight: bold;">true</span>
  <span style="color: #d33682; font-weight: bold;">false</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org1fc487c">
false
</pre>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #d33682; font-weight: bold;">false</span>
  <span style="color: #d33682; font-weight: bold;">true</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="org9f55d3c">
nil
</pre>

<p>
The actual results are not what I expected! Ruby&rsquo;s documentation does not list <code>Hash#map</code>, but <i>does</i> list <code>Enumerable#map</code>. I expected a 2-element hash but got a 2-element array instead composing an array of the keyed values from the has mapped to the code block. Not expected but good to know.
</p>
</div>
</div>
</div>

<div id="outline-container-org42ebd88" class="outline-2">
<h2 id="org42ebd88">Practice Problem 10</h2>
<div class="outline-text-2" id="text-org42ebd88">
</div>
<div id="outline-container-org7d04c04" class="outline-3">
<h3 id="org7d04c04">Question:</h3>
<div class="outline-text-3" id="text-org7d04c04">
<p>
What is the return value of the following code? Why?
</p>
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>].map <span style="color: #859900; font-weight: bold;">do</span> |num|
  <span style="color: #859900; font-weight: bold;">if</span> num &gt; <span style="color: #d33682; font-weight: bold;">1</span>
    <span style="color: #268bd2;">puts</span> num
  <span style="color: #859900; font-weight: bold;">else</span>
    num
  <span style="color: #859900; font-weight: bold;">end</span>
<span style="color: #859900; font-weight: bold;">end</span>
</pre>
</div>

<pre class="example" id="orgcfa99fd">
[1, nil, nil]
</pre>
</div>
</div>

<div id="outline-container-orgb8e3ba0" class="outline-3">
<h3 id="orgb8e3ba0">Answer:</h3>
<div class="outline-text-3" id="text-orgb8e3ba0">
<div class="org-src-container">
<pre class="src src-ruby">[<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">nil</span>, <span style="color: #d33682; font-weight: bold;">nil</span>]
</pre>
</div>

<pre class="example" id="org8080ccb">

</pre>

<p>
<code>2</code> and <code>3</code> are both greater than <code>1</code>, but <code>1</code> is not greater than <code>1</code>. The return value of <code>puts</code> is <code>nil</code>. Therefore, the array <code>[1, 2, 3]</code> will be mapped to <code>[1, nil, nil]</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brady Stanton</p>
<p class="date">Created: 2022-01-21 Fri 18:32</p>
</div>
</body>
</html>
